; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v3 ?v2)
             (pred_11 ?v13 ?v11)
             (pred_4 ?v3 ?v11)
             (pred_10 ?v9 ?v3 )
	     (pred_7 ?v3)
             (pred_8 ?v12)
             (pred_3 ?v13)
             (pred_2 ?v11)
             (pred_5 ?v3)
             (pred_6 ?v13)
             (pred_1 ?v3)
             (pred_12 ))



(:action op_1
:parameters (?v1 ?v6 ?v5 ?v8)
:precondition (and (pred_8 ?v1) (pred_8 ?v6) (pred_3 ?v5) (pred_2 ?v8)
          (pred_9 ?v1 ?v6) (pred_11 ?v5 ?v8)
                   (pred_4 ?v6 ?v8) (pred_7 ?v1) 
                   (pred_5 ?v6) (pred_6 ?v5))
:effect (and  (pred_1 ?v6) (not (pred_5 ?v6))))


(:action op_5
:parameters (?v1 ?v7)
:precondition (and (pred_8 ?v1) (pred_8 ?v7)
               (pred_7 ?v1) (pred_9 ?v1 ?v7) (pred_1 ?v7))
:effect (and (pred_7 ?v7) (not (pred_7 ?v1))))

(:action op_2
:parameters (?v1 ?v5)
:precondition (and (pred_8 ?v1) (pred_3 ?v5) 
                  (pred_7 ?v1) (pred_10 ?v5 ?v1) (pred_12 ))
:effect (and (pred_6 ?v5)
   (not (pred_10 ?v5 ?v1)) (not (pred_12 ))))


(:action op_3
:parameters (?v1 ?v10 ?v4)
:precondition (and (pred_8 ?v1) (pred_3 ?v10) (pred_3 ?v4)
                  (pred_7 ?v1) (pred_6 ?v4) (pred_10 ?v10 ?v1))
:effect (and (pred_6 ?v10) (pred_10 ?v4 ?v1)
        (not (pred_6 ?v4)) (not (pred_10 ?v10 ?v1))))

(:action op_4
:parameters (?v1 ?v5)
:precondition (and (pred_8 ?v1) (pred_3 ?v5) 
                  (pred_7 ?v1) (pred_6 ?v5))
:effect (and (pred_12 ) (pred_10 ?v5 ?v1) (not (pred_6 ?v5)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_14 obj_08 obj_20 obj_13 obj_09 obj_18 obj_01 obj_11 obj_12 obj_19 obj_04 obj_03 obj_05 obj_17 obj_07 obj_06
    obj_02 obj_15
    obj_16 obj_10
    )

    (:init
       (pred_12)

       (pred_8 obj_14)
       (pred_8 obj_08)
       (pred_8 obj_20)
       (pred_8 obj_13)
       (pred_8 obj_09)
       (pred_8 obj_18)
       (pred_8 obj_01)
       (pred_8 obj_11)
       (pred_8 obj_12)
       (pred_8 obj_19)
       (pred_8 obj_04)
       (pred_8 obj_03)
       (pred_8 obj_05)
       (pred_8 obj_17)
       (pred_8 obj_07)
       (pred_8 obj_06)
       (pred_2 obj_02)
       (pred_2 obj_15)
       (pred_3 obj_16)
       (pred_3 obj_10)

       (pred_9 obj_14 obj_09)
       (pred_9 obj_14 obj_08)
       (pred_9 obj_08 obj_18)
       (pred_9 obj_08 obj_20)
       (pred_9 obj_08 obj_14)
       (pred_9 obj_20 obj_01)
       (pred_9 obj_20 obj_13)
       (pred_9 obj_20 obj_08)
       (pred_9 obj_13 obj_11)
       (pred_9 obj_13 obj_20)
       (pred_9 obj_09 obj_12)
       (pred_9 obj_09 obj_18)
       (pred_9 obj_09 obj_14)
       (pred_9 obj_18 obj_19)
       (pred_9 obj_18 obj_01)
       (pred_9 obj_18 obj_08)
       (pred_9 obj_18 obj_09)
       (pred_9 obj_01 obj_04)
       (pred_9 obj_01 obj_11)
       (pred_9 obj_01 obj_20)
       (pred_9 obj_01 obj_18)
       (pred_9 obj_11 obj_03)
       (pred_9 obj_11 obj_13)
       (pred_9 obj_11 obj_01)
       (pred_9 obj_12 obj_05)
       (pred_9 obj_12 obj_19)
       (pred_9 obj_12 obj_09)
       (pred_9 obj_19 obj_17)
       (pred_9 obj_19 obj_04)
       (pred_9 obj_19 obj_18)
       (pred_9 obj_19 obj_12)
       (pred_9 obj_04 obj_07)
       (pred_9 obj_04 obj_03)
       (pred_9 obj_04 obj_01)
       (pred_9 obj_04 obj_19)
       (pred_9 obj_03 obj_06)
       (pred_9 obj_03 obj_11)
       (pred_9 obj_03 obj_04)
       (pred_9 obj_05 obj_17)
       (pred_9 obj_05 obj_12)
       (pred_9 obj_17 obj_07)
       (pred_9 obj_17 obj_19)
       (pred_9 obj_17 obj_05)
       (pred_9 obj_07 obj_06)
       (pred_9 obj_07 obj_04)
       (pred_9 obj_07 obj_17)
       (pred_9 obj_06 obj_03)
       (pred_9 obj_06 obj_07)
       (pred_5 obj_11)
       (pred_5 obj_03)
       (pred_4  obj_11 obj_02)
       (pred_4  obj_03 obj_15)
       (pred_1 obj_14)
       (pred_1 obj_08)
       (pred_1 obj_20)
       (pred_1 obj_13)
       (pred_1 obj_09)
       (pred_1 obj_18)
       (pred_1 obj_01)
       (pred_1 obj_12)
       (pred_1 obj_19)
       (pred_1 obj_04)
       (pred_1 obj_05)
       (pred_1 obj_17)
       (pred_1 obj_07)
       (pred_1 obj_06)

       (pred_11  obj_16 obj_02)
       (pred_11  obj_10 obj_15)
       (pred_10 obj_16 obj_14)
       (pred_10 obj_10 obj_04)
       (pred_7 obj_09)
    )

    (:goal (and
       (pred_10 obj_16 obj_11)
    ))
(:constraints
  (always (not (pred_7 obj_13)))
)
)

; plan
1. (op_5 obj_09 obj_14)
   deleted: (pred_7 obj_09)
   added: (pred_7 obj_14)
   goals met: 0 of 1
2. (op_2 obj_14 obj_16)
   deleted: (pred_10 obj_16 obj_14) (pred_12)
   added: (pred_6 obj_16)
   goals met: 0 of 1
3. (op_5 obj_14 obj_08)
   deleted: (pred_7 obj_14)
   added: (pred_7 obj_08)
   goals met: 0 of 1
4. (op_5 obj_08 obj_20)
   deleted: (pred_7 obj_08)
   added: (pred_7 obj_20)
   goals met: 0 of 1
5. (op_5 obj_20 obj_01)
   deleted: (pred_7 obj_20)
   added: (pred_7 obj_01)
   goals met: 0 of 1
6. (op_1 obj_01 obj_11 obj_16 obj_02)
   deleted: (pred_5 obj_11)
   added: (pred_1 obj_11)
   goals met: 0 of 1
7. (op_5 obj_01 obj_11)
   deleted: (pred_7 obj_01)
   added: (pred_7 obj_11)
   goals met: 0 of 1
8. (op_4 obj_11 obj_16)
   deleted: (pred_6 obj_16)
   added: (pred_12) (pred_10 obj_16 obj_11)
   goals met: 1 of 1
